testing/case_0p8/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "20000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
10981
(
6.89444e-06
3.33654e-05
4.0873e-05
4.47897e-05
4.75471e-05
4.98742e-05
5.20146e-05
5.40374e-05
...
)
;

boundaryField
{
    bottomWall
    {
        Ceps2           1.9;
        type            kLowReWallFunction;
        value           nonuniform List<scalar> 
139
(
1.89804e-07
1.53621e-07
1.02106e-07
5.56786e-08
2.38413e-08
1.10122e-08
5.79163e-09
3.26367e-09
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    topWall
    {
        Ceps2           1.9;
        type            kLowReWallFunction;
        value           nonuniform List<scalar> 
139
(
1.66627e-08
1.68977e-08
1.74009e-08
1.83013e-08
1.96577e-08
2.13751e-08
2.33847e-08
2.56406e-08
...
)
;
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
