testing/case_0p8/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "20000";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
21744
(
-1.4819e-07
4.44034e-06
9.07206e-08
8.78825e-06
6.23587e-07
1.16627e-05
1.33679e-06
1.41831e-05
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
        value           nonuniform 0();
    }
    topWall
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            cyclic;
        value           nonuniform List<scalar> 
79
(
4.29215e-06
9.02717e-06
1.21956e-05
1.48963e-05
1.73797e-05
1.97659e-05
2.21321e-05
2.45315e-05
...
)
;
    }
    inlet
    {
        type            cyclic;
        value           nonuniform List<scalar> 
79
(
-4.29215e-06
-9.02717e-06
-1.21956e-05
-1.48963e-05
-1.73797e-05
-1.97659e-05
-2.21321e-05
-2.45315e-05
...
)
;
    }
}


// ************************************************************************* //
